Repository: Behat/MinkExtension
Catalog: i18n/*.xliff
Languages: da, de, hu, pl, pt, pt_br, sk, zh_cn

# i-am-homepage
source: /^(?:|I )am on (?:|the )homepage$/
da: /^(?:|jeg )er på hjemmesiden$/
hu: /^a címlapon (?:vagyok|van)$/
pl: /^jestem na stronie głównej$/
pt: /^(?:|Eu )estou na página de entrada/
pt_br: /^(?:|Eu )estou na página inicial$/

# i-go-to-homepage
source: /^(?:|I )go to (?:|the )homepage$/
da: /^(?:|jeg )går til hjemmesiden$/
de: /^(?:|ich )gehe (?:|ich )auf (?:|die )Startseite$/
hu: /^(?:ellátogat|ellátogatok) a címlapra$/
pl: /^odwiedzę stronę główną$/
pt: /^(?:|Eu )vou para a página de entrada$/
pt_br: /^(?:|Eu )vou à página inicial$/

# i-am-on-page
source: /^(?:|I )am on "(?P<page>[^"]+)"$/
da: /^(?:|jeg )er på "(?P<side>[^"]+)"$/
de: /^(?:|ich )bin (?:|ich )auf "(?P<page>[^"]+)"$/
hu: /^az? "(?P<page>[^"]+)" oldalon (?:vagyok|van)$/
pl: /^jestem na stronie "(?P<page>[^"]+)"$/
pt: /^(?:|Eu )estou em "(?P<page>[^"]+)"$/
pt_br: /^(?:|Eu )estou em "(?P<page>[^"]+)"$/
sk: /^(?:som|nachádzam sa) na(?:| stránke) "(?P<page>[^"]+)"$/
zh_cn: /^(?:|我)打开了“(?P<page>[^\s]+)”$/

# i-go-to-page
source: /^(?:|I )go to "(?P<page>[^"]+)"$/
da: /^(?:|jeg )går til "(?P<side>[^"]+)"$/
de: /^(?:|ich )gehe (?:|ich )nach "(?P<page>[^"]+)"$/
hu: /^(?:ellátogat|ellátogatok) az? "(?P<page>[^"]+) oldalra"$/
pl: /^odwiedzę stronę "(?P<page>[^"]+)"$/
pt: /^(?:|Eu )vou para "(?P<page>[^"]+)"$/
pt_br: /^(?:|Eu )vou à "(?P<page>[^"]+)"$/
sk: /^(?:prej|pôj)dem na(?:| stránku) "(?P<page>[^"]+)"$/
zh_cn: /^(?:|我)转到了“(?P<page>[^\s]+)”$/

# reload-the-page
source: /^(?:|I )reload the page$/
da: /^(?:|jeg )genindlæser siden$/
de: /^(?:|ich )aktualisiere (?:|ich )die Seite$/
hu: /^(?:újratöltöm|újratölti) az oldalt$/
pl: /^odświeżę stronę$/
pt: /^(?:|Eu )recarrego a página$/
pt_br: /^(?:|Eu )recarrego a página$/
sk: /^obnovím stránku$/
zh_cn: /^(?:|我)重新刷新了该网页$/

# move-backward-one-page
source: /^(?:|I )move backward one page$/
da: /^(?:|jeg )går en side tilbage$/
de: /^(?:|ich )gehe (?:|ich )eine Seite zurück$/
hu: /^az előző oldalra (?:látogatok|látogat)$/
pl: /^cofnę się do poprzedniej strony$/
pt: /^(?:|Eu )voltei uma página$/
pt_br: /^(?:|Eu )volto uma página$/
sk: /^(?:prej|pôj)dem o jednu stránku (?:|na)späť$/
zh_cn: /^(?:|我)后退了一页$/

# move-forward-one-page
source: /^(?:|I )move forward one page$/
da: /^(?:|jeg )går en side frem$/
de: /^(?:|ich )gehe (?:|ich )eine Seite vorwärts$/
hu: /^a következő oldalra (?:látogatok|látogat)$/
pl: /^przejdę na kolejną stronę$/
pt: /^(?:|Eu )avancei uma página$/
pt_br: /^(?:|Eu )avanço uma página$/
sk: /^(?:prej|pôj)dem o jednu stránku (?:vpred|vopred|dopredu)$/
zh_cn: /^(?:|我)前进了一页$/

# i-press-button
source: /^(?:|I )press "(?P<button>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )trykker "(?P<knap>(?:[^"]|\\")*)"$/
de: /^(?:|ich )drücke (?:|ich )"(?P<button>(?:[^"]|\\")*)"$/
hu: /^(?:megnyomom|megnyomja|lenyomom|lenyomja) az? "(?P<button>(?:[^"]|\\")*)" gombot$/
pl: /^nacisnę przycisk "(?P<button>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )pressiono "(?P<button>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )pressiono o botão "(?P<button>(?:[^"]|\\")*)"$/
sk: /^(?:stlačím|stisnem|kliknem na) (?:tlačídko|tlačidlo|tlačítko) "(?P<button>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)点击了“(?P<button>(?:[^"]|\\")*)”按钮$/

# i-follow-link
source: /^(?:|I )follow "(?P<link>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )følger "(?P<link>(?:[^"]|\\")*)"$/ /^(?:|jeg )klikker "(?P<link>(?:[^"]|\\")*)"$/
de: /^(?:|ich )folge (?:|ich )"(?P<link>(?:[^"]|\\")*)"$/
hu: /^(?:követem|követi) az? "(?P<link>(?:[^"]|\\")*)" linket$/
pl: /^kliknę na link "(?P<link>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )sigo o link "(?P<link>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )sigo o link "(?P<link>(?:[^"]|\\")*)"$/
sk: /^kliknem na(?:| odkaz| link) "(?P<link>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)点击了“(?P<link>(?:[^"]|\\")*)”链接$/

# i-fill-in-field-with-value
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )udfylder "(?P<felt>(?:[^"]|\\")*)" med "(?P<value>(?:[^"]|\\")*)"$/
de: /^(?:|ich )gebe (?:|ich )in das Feld "(?P<field>(?:[^"]|\\")*)" "(?P<value>(?:[^"]|\\")*)" ein$/
hu: /^(?:kitöltöm|kitölti) az? "(?P<field>(?:[^"]|\\")*)" mezőt "(?P<value>(?:[^"]|\\")*)" értékkel$/
pl: /^wypełnię pole "(?P<field>(?:[^"]|\\")*)" wartością "(?P<value>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )preencho "(?P<field>(?:[^"]|\\")*)" com "(?P<value>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )preencho o campo "(?P<field>(?:[^"]|\\")*)" com "(?P<value>(?:[^"]|\\")*)"$/
sk: /^(?:vyplním|zadám do) "(?P<field>(?:[^"]|\\")*)" (?:hodnotou|hodnotu) "(?P<value>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)在“(?P<field>(?:[^"]|\\")*)”文本框内填写了“(?P<value>(?:[^"]|\\")*)”$/

# i-fill-in-field-with
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with:$/
da: /^(?:|jeg )udfylder "(?P<felt>(?:[^"]|\\")*)" med:$/
hu: /^(?:kitöltöm|kitölti) az? "(?P<field>(?:[^"]|\\")*)" mezőt a következő értékekkel:$/
pl: /^wypełnię pole "(?P<field>(?:[^"]|\\")*)" wartością:$/
pt_br: /^(?:|Eu )preencho o campo "(?P<field>(?:[^"]|\\")*)" com:$/

# i-fill-in-value-for-field
source: /^(?:|I )fill in "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )udfylder "(?P<value>(?:[^"]|\\")*)" for "(?P<felt>(?:[^"]|\\")*)"$/
de: /^(?:|ich )gebe (?:|ich )"(?P<value>(?:[^"]|\\")*)" in "(?P<field>(?:[^"]|\\")*)" ein$/
hu: /^az? "(?P<value>(?:[^"]|\\")*)" értékkel (?:kitöltöm|kitölti) az? "(?P<field>(?:[^"]|\\")*)" mezőt$/
pl: /^wpiszę "(?P<value>(?:[^"]|\\")*)" w polu "(?P<field>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )preencho "(?P<value>(?:[^"]|\\")*)" para "(?P<field>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )preencho o valor "(?P<value>(?:[^"]|\\")*)" no campo "(?P<field>(?:[^"]|\\")*)"$/
sk: /^(?:zadám|vyplním) "(?P<value>(?:[^"]|\\")*)" (?:hodnotu|hodnotou) "(?P<field>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)内填写了“(?P<value>(?:[^"]|\\")*)”到“(?P<field>(?:[^"]|\\")*)”文本框$/

source: /^(?:|I )fill in the following:$/
da: /^(?:|jeg )udfylder følgende:$/
de: /^(?:|ich )gebe (?:|ich )das folgende ein:$/
hu: /^Amennyiben (?:kitöltöm|kitölti) a következőket:$/
pl: /^wypełnię następujące pola:$/
pt: /^(?:|Eu )preencho o seguinte:$/
pt_br: /^(?:|Eu )preencho os seguintes valores:$/
sk: /^vyplním formulár(?:| nasledujúco):$/
zh_cn: /^(?:|我)使用以下数据输入:$/

# i-select-option-from-select
source: /^(?:|I )select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )vælger "(?P<valgmulighed>(?:[^"]|\\")*)" fra "(?P<select>(?:[^"]|\\")*)"$/
de: /^(?:|ich )wähle (?:|ich )"(?P<option>(?:[^"]|\\")*)" von "(?P<select>(?:[^"]|\\")*)"$/
hu: /^(?:kiválasztom|kiválasztja) az? "(?P<option>(?:[^"]|\\")*)" leheőséget az? "(?P<select>(?:[^"]|\\")*)" legördülő listából$/
pl: /^wybiorę opcję "(?P<option>(?:[^"]|\\")*)" w polu "(?P<select>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )seleciono "(?P<option>(?:[^"]|\\")*)" de "(?P<select>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )seleciono a opção "(?P<option>(?:[^"]|\\")*)" no campo "(?P<select>(?:[^"]|\\")*)"$/
sk: /^(?:vyberiem|zvolím)(?:| možnosť) "(?P<option>(?:[^"]|\\")*)" z "(?P<select>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)在“(?P<select>(?:[^"]|\\")*)”选择框里面选择了“(?P<option>(?:[^"]|\\")*)”$/

# i-additionally-select-option-from-select
source: /^(?:|I )additionally select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )derudover vælger "(?P<valgmulighed>(?:[^"]|\\")*)" fra "(?P<select>(?:[^"]|\\")*)"$/
de: /^(?:|ich )wähle (?:|ich )zusätzlich "(?P<option>(?:[^"]|\\")*)" von "(?P<select>(?:[^"]|\\")*)"$/
hu: /^(?:kiválasztom|kiválasztja) a "(?P<option>(?:[^"]|\\")*)" további lehetőséget az? "(?P<select>(?:[^"]|\\")*)" legördülő listából$/
pl: /^dodatkowo zaznaczę opcję "(?P<option>(?:[^"]|\\")*)" w polu "(?P<select>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )seleciono também "(?P<option>(?:[^"]|\\")*)" de "(?P<select>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )seleciono também "(?P<option>(?:[^"]|\\")*)" no campo "(?P<select>(?:[^"]|\\")*)"$/
sk: /^ešte (?:vyberiem|zvolím)(?:| možnosť) "(?P<option>(?:[^"]|\\")*)" z "(?P<select>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)在“(?P<select>(?:[^"]|\\")*)”选择框里面添加了“(?P<option>(?:[^"]|\\")*)”选择$/

# i-check-option
source: /^(?:|I )check "(?P<option>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )markerer "(?P<valgmulighed>(?:[^"]|\\")*)"$/
de: /^(?:|ich )aktiviere (?:|ich )"(?P<option>(?:[^"]|\\")*)"$/
hu: /^(?:kiválasztom|kiválasztja) az? "(?P<option>(?:[^"]|\\")*) opciót"$/
pl: /^zaznaczę opcję "(?P<option>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )marco "(?P<option>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )marco a opção "(?P<option>(?:[^"]|\\")*)"$/
sk: /^(?:zaškrtnem|označím) "(?P<option>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)选中了“(?P<option>(?:[^"]|\\")*)”选项$/

# i-uncheck-option
source: /^(?:|I )uncheck "(?P<option>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )afmarkerer "(?P<valgmulighed>(?:[^"]|\\")*)"$/
de: /^(?:|ich )deaktiviere (?:|ich )"(?P<option>(?:[^"]|\\")*)"$/
hu: /^(?:törlöm|törli) az? "(?P<option>(?:[^"]|\\")*)" opciót$/
pl: /^odznaczę opcję "(?P<option>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )desmarco "(?P<option>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )desmarco a opção "(?P<option>(?:[^"]|\\")*)"$/
sk: /^(?:odškrtnem|odznačím) "(?P<option>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)取消了“(?P<option>(?:[^"]|\\")*)”选项$/

# i-attach-the-file-to-field
source: /^(?:|I )attach the file "(?P<path>[^"]*)" to "(?P<field>(?:[^"]|\\")*)"$/
da: /^(?:|jeg )vedhæfter filen "(?P<sti>[^"]*)" til "(?P<felt>(?:[^"]|\\")*)"$/
de: /^(?:|ich )lade (?:|ich )die Datei "(?P<path>[^"]*)" in "(?P<field>(?:[^"]|\\")*)"$/
hu: /^(?:csatolom|csatolja) az? "(?P<path>[^"]*)" fájlt az? "(?P<field>(?:[^"]|\\")*)" mezőhöz$/
pl: /^załączę plik "(?P<path>[^"]*)" w polu "(?P<field>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )anexo o arquivo "(?P<path>[^"]*)" в поле "(?P<field>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )anexo o arquivo "(?P<path>[^"]*)" no campo "(?P<field>(?:[^"]|\\")*)"$/
sk: /^(?:vyberiem|zvolím|zadám|nahrajem|načítam) súbor "(?P<path>[^"]*)" do "(?P<field>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)添加了文件“(?P<path>[^"]*)”到“(?P<field>(?:[^"]|\\")*)”文件选择框$/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)"$/
da: /^(?:|skulle jeg )se "(?P<tekst>(?:[^"]|\\")*)"$/
de: /^(?:|ich )sollte (?:|ich )"(?P<text>(?:[^"]|\\")*)" sehen$/
hu: /^az? "(?P<text>(?:[^"]|\\")*)" szöveget kell (?:látnom|látnia)$/
pl: /^zobaczę tekst "(?P<text>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )devo ver "(?P<text>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )devo ver o texto "(?P<text>(?:[^"]|\\")*)"$/
sk: /^(?:by som mal(?:|a)|mal(?:|a) by som|musím) (?:|u)vidieť(?:| text| hlášku| správu) "(?P<text>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)应该可以看见包含“(?P<text>(?:[^"]|\\")*)”的内容$/

# i-should-see-text-matching
source: /^(?:|I )should see text matching (?P<pattern>"(?:[^"]|\\")*")$/
da: /^(?:|skulle jeg )se tekst matche (?P<pattern>"(?:[^"]|\\")*")$/
de: /^(?:|ich )sollte (?:|ich )folgenden Text sehen (?P<pattern>"(?:[^"]|\\")*")$/
hu: /^az? (?P<pattern>"(?:[^"]|\\")*") mintára illeszkedő szöveget (?:látnom|látnia) kell$/
pl: /^zobaczę tekst pasujący do (?P<pattern>"(?:[^"]|\\")*")$/
pt: /^(?:|Eu )devo ver o texto que coincide com (?P<pattern>"(?:[^"]|\\")*")$/
pt_br: /^(?:|Eu )devo ver o texto que coincide com (?P<pattern>"(?:[^"]|\\")*")$/
sk: /^(?:mal(?:|a) by som|by som mal(?:|a)|musím) (?:|u)vidieť(?:| text| hlášku| správu) zodpovedajúcu(?:| vzoru) (?P<pattern>"(?:[^"]|\\")*")$/

# i-should-not-see-text-matching
source: /^(?:|I )should not see text matching (?P<pattern>"(?:[^"]|\\")*")$/
da: /^(?:|skulle jeg )ikke se tekst matche (?P<pattern>"(?:[^"]|\\")*")$/
de: /^(?:|ich )sollte (?:|ich )nicht folgenden Text sehen (?P<pattern>"(?:[^"]|\\")*")$/
hu: /^az? (?P<pattern>"(?:[^"]|\\")*") mintára illeszkedő szöveget nem szabad (?:látnom|látnia)$/
pl: /^nie zobaczę tekstu pasującego do (?P<pattern>"(?:[^"]|\\")*")$/
pt: /^(?:|Eu )não devo ver o texto que coincide com (?P<pattern>"(?:[^"]|\\")*")$/
pt_br: /^(?:|Eu )não devo ver o texto que coincide com (?P<pattern>"(?:[^"]|\\")*")$/
sk: /^(?:nemal(?:|a) by som|by som nemal(?:|a)|nesmiem) (?:|u)vidieť(?:| text| hlášku| správu) zodpovedajúcu(?:| vzoru) (?P<pattern>"(?:[^"]|\\")*")$/

# the-response-should-contain
source: /^the response should contain "(?P<text>(?:[^"]|\\")*)"$/
da: /^skulle responsen indeholde "(?P<tekst>(?:[^"]|\\")*)"$/
de: /^(?:|sollte )die Rückmeldung (?:|sollte )"(?P<text>(?:[^"]|\\")*)" enthalten$/
hu: /^a válasznak tartalmaznia kell a következőt: "(?P<text>(?:[^"]|\\")*)"$/
pl: /^odpowiedź powinna zawierać tekst "(?P<text>(?:[^"]|\\")*)"$/
pt: /^a resposta deve conter "(?P<text>(?:[^"]|\\")*)"$/
pt_br: /^a resposta deve conter "(?P<text>(?:[^"]|\\")*)"$/
sk: /^(?:odpoveď|stránka) (?:musí|by mala) obsahovať(?:| text) "(?P<text>(?:[^"]|\\")*)"$/
zh_cn: /^响应应该包含“(?P<text>(?:[^"]|\\")*)”的内容$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)"$/
da: /^(?:|skulle jeg )ikke se "(?P<tekst>(?:[^"]|\\")*)"$/
de: /^(?:|ich )sollte (?:|ich )nicht "(?P<text>(?:[^"]|\\")*)" sehen$/
hu: /^az? "(?P<text>(?:[^"]|\\")*)" szöveget nem szabad (?:látnom|látnia)$/
pl: /^nie zobaczę tekstu "(?P<text>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )não devo ver "(?P<text>(?:[^"]|\\")*)"$/
pt_br: /^(?:|Eu )não devo ver o texto "(?P<text>(?:[^"]|\\")*)"$/
sk: /^(?:nemal(?:|a) by som|by som nemal(?:|a))|nesmiem) (?:|u)vidieť(?:| text) "(?P<text>(?:[^"]|\\")*)"$/
zh_cn: /^(?:|我)应该不能看见包含“(?P<text>(?:[^"]|\\")*)”的内容$/

# the-response-should-not-contain
source: /^the response should not contain "(?P<text>(?:[^"]|\\")*)"$/
da: /^skulle responsen ikke indeholde "(?P<tekst>(?:[^"]|\\")*)"$/
de: /^(?:|sollte )die Rückmeldung (?:|sollte )nicht "(?P<text>(?:[^"]|\\")*)" enthalten$/
hu: /^a válasznak nem szabad tartalmaznia "(?P<text>(?:[^"]|\\")*)"$/
pl: /^odpowiedź nie powinna zawierać tekstu "(?P<text>(?:[^"]|\\")*)"$/
pt: /^a resposta não deve conter "(?P<text>(?:[^"]|\\")*)"$/
pt_br: /^a resposta não deve conter "(?P<text>(?:[^"]|\\")*)"$/
sk: /^(?:odpoveď|stránka) (?:by nemala|nesmie) obsahovať(?:| text) "(?P<text>(?:[^"]|\\")*)"$/
zh_cn: /^响应不应该包含“(?P<text>(?:[^"]|\\")*)”的内容$/

# the-field-should-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should contain "(?P<value>(?:[^"]|\\")*)"$/
da: /^skulle feltet "(?P<felt>(?:[^"]|\\")*)" indeholde "(?P<value>(?:[^"]|\\")*)"$/
de: /^(?:|sollte )das "(?P<field>(?:[^"]|\\")*)" Feld (?:|sollte )"(?P<value>(?:[^"]|\\")*)" enthalten$/
hu: /^az? "(?P<field>(?:[^"]|\\")*)" mezőnek tartalmaznia kell a következő értéket: "(?P<value>(?:[^"]|\\")*)"$/
pl: /^pole "(?P<field>(?:[^"]|\\")*)" powinno zawierać wartość "(?P<value>(?:[^"]|\\")*)"$/
pt: /^o campo "(?P<field>(?:[^"]|\\")*)" deve conter "(?P<value>(?:[^"]|\\")*)"$/
pt_br: /^o campo "(?P<field>(?:[^"]|\\")*)" deve conter o valor "(?P<value>(?:[^"]|\\")*)"$/
sk: /^pole "(?P<field>(?:[^"]|\\")*)" (?:musí obsahovať|malo by obsahovať|by malo obsahovať|obsahuje)(?:| text| hodnotu) "(?P<value>(?:[^"]|\\")*)"$/
zh_cn: /^“(?P<field>(?:[^"]|\\")*)”文本框应该包含值“(?P<value>(?:[^"]|\\")*)”$/

# the-field-should-not-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should not contain "(?P<value>(?:[^"]|\\")*)"$/
da: /^skulle feltet "(?P<felt>(?:[^"]|\\")*)" ikke indeholde "(?P<value>(?:[^"]|\\")*)"$/
de: /^(?:|sollte )das "(?P<field>(?:[^"]|\\")*)" Feld (?:|sollte )nicht "(?P<value>(?:[^"]|\\")*)" enthalten$/
hu: /^az? "(?P<field>(?:[^"]|\\")*)" mezőnek nem szabad tartalmaznia a következő értéket: "(?P<value>(?:[^"]|\\")*)"$/
pl: /^pole "(?P<field>(?:[^"]|\\")*)" nie powinno zawierać wartości "(?P<value>(?:[^"]|\\")*)"$/
pt: /^o campo "(?P<field>(?:[^"]|\\")*)" não deve conter "(?P<value>(?:[^"]|\\")*)"$/
pt_br: /^o campo "(?P<field>(?:[^"]|\\")*)" não deve conter o valor "(?P<value>(?:[^"]|\\")*)"$/
sk: /^pole "(?P<field>(?:[^"]|\\")*)" (?:nesmie obsahovať|nemalo by obsahovať|by nemalo obsahovať|neobsahuje)(?:| text| hodnotu) "(?P<value>(?:[^"]|\\")*)"$/
zh_cn: /^“(?P<field>(?:[^"]|\\")*)”文本框应该不包含值“(?P<value>(?:[^"]|\\")*)”$/

# the-checkbox-should-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should be checked$/
da: /^skulle afkrydsningsfeltet "(?P<felt>(?:[^"]|\\")*)" være markeret$/
de: /^(?:|sollte )die "(?P<checkbox>(?:[^"]|\\")*)" checkbox (?:|sollte )aktiviert sein$/
hu: /^az? "(?P<checkbox>(?:[^"]|\\")*)" jelölőnégyzetnek be kell jelölve lennie$/
pl: /^zaznaczono pole "(?P<checkbox>(?:[^"]|\\")*)"$/
pt: /^o checkbox "(?P<checkbox>(?:[^"]|\\")*)" deve ser marcado$/
pt_br: /^o checkbox "(?P<checkbox>(?:[^"]|\\")*)" deve ser marcado$/
sk: /^(?:pole|políčko|zaškrtávacie pole|zaškrtávacie políčko) "(?P<checkbox>(?:[^"]|\\")*)" (?:by malo byť|je) (?:zaškrtnuté|označené)$/
zh_cn: /^“(?P<checkbox>(?:[^"]|\\")*)”选项框应该已经选中了$/

# the-checkbox-should-is-checked
source: /^the checkbox "(?P<checkbox>(?:[^"]|\\")*)" (?:is|should be) checked$/
da: /^er afkrydsningsfeltet "(?P<felt>(?:[^"]|\\")*)" markeret$/
hu: /^az? "(?P<checkbox>(?:[^"]|\\")*)" jelölőnégyzetnek be kell lennie jelölve$/
pl: /^pole "(?P<checkbox>(?:[^"]|\\")*)" (?:jest|powinno być) zaznaczone/
pt_br: /^o checkbox "(?P<checkbox>(?:[^"]|\\")*)" deve estar marcado$/

# the-checkbox-should-be-unchecked
source: /^the checkbox "(?P<checkbox>(?:[^"]|\\")*)" should (?:be unchecked|not be checked)$/
da: /^skulle afkrydsningsfeltet "(?P<checkbox>(?:[^"]|\\")*)" være afmarkeret$/
hu: /^az? "(?P<checkbox>(?:[^"]|\\")*)" jelölőnégyzetnek törölve kell lennie$/
pl: /^pole "(?P<checkbox>(?:[^"]|\\")*)" nie (?:jest|powinno być) zaznaczone$/
pt_br: /^o checkbox "(?P<checkbox>(?:[^"]|\\")*)" deve ser desmarcado$/

# the-checkbox-is-unchecked
source: /^the checkbox "(?P<checkbox>(?:[^"]|\\")*)" is (?:unchecked|not checked)$/
da: /^er afkrydsningsfeltet "(?P<felt>(?:[^"]|\\")*)" afmarkeret$/
hu: /^az? "(?P<checkbox>(?:[^"]|\\")*)" jelölőnégyzet törölve van$/
pl: /^pole "(?P<checkbox>(?:[^"]|\\")*)" (?:jest|powinno być) odznaczone$/
pt_br: /^o checkbox "(?P<checkbox>(?:[^"]|\\")*)" deve estar desmarcado$/

# the-checkbox-should-not-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should not be checked$/
da: /^skulle afkrydsningsfeltet "(?P<felt>(?:[^"]|\\")*)" ikke være markeret$/
de: /^(?:|sollte )die "(?P<checkbox>(?:[^"]|\\")*)" checkbox (?:|sollte )nicht aktiviert sein$/
pl: /^odznaczono pole "(?P<checkbox>(?:[^"]|\\")*)"$/
pt: /^o checkbox "(?P<checkbox>(?:[^"]|\\")*)" não deve ser marcado$/
sk: /^(?:pole|políčko|zaškrtávacie pole|zaškrtávacie políčko) "(?P<checkbox>(?:[^"]|\\")*)" (?:by nemalo byť|nie je) (?:zaškrtnuté|označené)$/
zh_cn: /^“(?P<checkbox>(?:[^"]|\\")*)”选项框应该还没有选中$/

# i-should-be-on-page
source: /^(?:|I )should be on "(?P<page>[^"]+)"$/
da: /^(?:|skulle jeg )være på "(?P<side>[^"]+)"$/
de: /^(?:|ich )sollte (?:|ich )auf "(?P<page>[^"]+)" sein$/
hu: /^a? "(?P<page>[^"]+)" oldalon kell (?:lennem|lennie)$/
pl: /^powinienem być na stronie "(?P<page>[^"]+)"$/
pt: /^(?:|Eu )estar em "(?P<page>[^"]+)"$/
pt_br: /^(?:|Eu )devo estar em "(?P<page>[^"]+)"$/
sk: /^(?:mal(?:|a) by som byť|by som mal(?:|a) byť|som|musím byť) na(?:| stránke) "(?P<page>[^"]+)"$/
zh_cn: /^(?:|我)应该到了“(?P<page>[^\s]+)”$/

# i-should-be-on-homepage
source: /^(?:|I )should be on (?:|the )homepage$/
da: /^(?:|skulle jeg )være på hjemmesiden$/
hu: /^a címlapon kell (?:lennem|lennie)/
pl: /^powinienem być na stronie głównej/
pt_br: /^(?:|Eu )devo estar na página inicial/

# the-url-should-match
source: /^the (?i)url(?-i) should match (?P<pattern>"([^"]|\\")*")$/
da: /^skulle webadressen matche (?P<pattern>"([^"]|\\")*")$/
de: /^(?:|sollte )die Webadresse (?:|sollte )mit (?P<pattern>"([^"]|\\")*") übereinstimmen$/
hu: /^az? (?:url|webcím) illeszkedik a következő mintára: (?P<pattern>"([^"]|\\")*")$/
pt: /^a (?i)url(?-i) deve coincidir com (?P<pattern>"([^"]|\\")*")$/
pt_br: /^a url deve coincidir com (?P<pattern>"([^"]|\\")*")$/
sk: /^(?:url|adresa|link) (?:by mal(?:|a)|mal(?:|a) by|musí) zodpovedať(?:| vzoru) (?P<pattern>"([^"]|\\")*")$/
zh_cn: /^(?i)url(?-i) 应该匹配“(?P<pattern>"([^"]|\\")*")”$/

# the-element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>(?:[^"]|\\")*)"$/
da: /^skulle elementet "(?P<element>[^"]*)" indeholde "(?P<value>(?:[^"]|\\")*)"$/
de: /^(?:|sollte )das "(?P<element>[^"]*)" Element (?:|sollte )"(?P<value>(?:[^"]|\\")*)" enthalten$/
hu: /^az? "(?P<element>[^"]*)" tartalmaznia kell a következő értéket: "(?P<value>(?:[^"]|\\")*)"$/
pl: /^element "(?P<element>[^"]*)" powinien zawierać "(?P<value>(?:[^"]|\\")*)"$/
pt: /^o elemento "(?P<element>[^"]*)" deve conter "(?P<value>(?:[^"]|\\")*)"$/
pt_br: /^o elemento "(?P<element>[^"]*)" deve conter "(?P<value>(?:[^"]|\\")*)"$/
sk: /^element "(?P<element>[^"]*)" (?:by mal|mal by|musí) obsahovať(?:| text| hodnotu) "(?P<value>(?:[^"]|\\")*)"$/
zh_cn: /^“(?P<element>[^"]*)”元素应该包含“(?P<value>(?:[^"]|\\")*)”内容$/

# the-element-should-not-contain
source: /^the "(?P<element>[^"]*)" element should not contain "(?P<value>(?:[^"]|\\")*)"$/
da: /^skulle elementet "(?P<element>[^"]*)" ikke indeholde "(?P<value>(?:[^"]|\\")*)"$/
de: /^(?:|sollte )das "(?P<element>[^"]*)" Element (?:|sollte )nicht "(?P<value>(?:[^"]|\\")*)" enthalten$/
hu: /^az? "(?P<element>[^"]*)" nem szabad tartalmaznia a következő értéket: "(?P<value>(?:[^"]|\\")*)"$/
pl: /^element "(?P<element>[^"]*)" nie powinien zawierać "(?P<value>(?:[^"]|\\")*)"$/
pt_br: /^o elemento "(?P<element>[^"]*)" não deve conter "(?P<value>(?:[^"]|\\")*)"$/

# i-should-see-text-in-element
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
da: /^(?:|skulle jeg )se "(?P<tekst>(?:[^"]|\\")*)" i elementet "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte (?:|ich )"(?P<text>(?:[^"]|\\")*)" im "(?P<element>[^"]*)" Element sehen$/
hu: /^az? "(?P<text>(?:[^"]|\\")*)" szöveget (?:látnom|látnia) kell az? "(?P<element>[^"]*)" elemben$/
pl: /^powinienem widzieć "(?P<text>(?:[^"]|\\")*)" wewnątrz elementu "(?P<element>[^"]*)"$/
pt: /^(?:|Eu )devo ver "(?P<text>(?:[^"]|\\")*)" no elemento "(?P<element>[^"]*)"$/
pt_br: /^(?:|Eu )eu devo ver o texto "(?P<text>(?:[^"]|\\")*)" no elemento "(?P<element>[^"]*)"$/
sk: /^(?:mal(?:|a) by som|by som mal(?:|a)|musím) (?:|u)vidieť(?:| text| hodnotu| hlášku| správu) "(?P<text>(?:[^"]|\\")*)" v elemente "(?P<element>[^"]*)"$/
zh_cn: /^“(?P<element>[^"]*)”元素应该有“(?P<value>(?:[^"]|\\")*)”内容$/

# i-should-not-see-text-in-element
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
da: /^(?:|skulle jeg )ikke se "(?P<tekst>(?:[^"]|\\")*)" i elementet "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte (?:|ich )nicht "(?P<text>(?:[^"]|\\")*)" im "(?P<element>[^"]*)" Element sehen$/
hu: /^az? "(?P<text>(?:[^"]|\\")*)" szöveget nem szabad (?:látnom|látnia) az? "(?P<element>[^"]*)" elemben$/
pl: /^nie powinienem widzieć "(?P<text>(?:[^"]|\\")*)" wewnątrz elementu "(?P<element>[^"]*)"$/
pt: /^(?:|Eu )não deveria de ver "(?P<text>(?:[^"]|\\")*)" no elemento "(?P<element>[^"]*)"$/
pt_br: /^(?:|Eu )não devo ver o texto "(?P<text>(?:[^"]|\\")*)" no elemento "(?P<element>[^"]*)"$/
zh_cn: /^“(?P<element>[^"]*)”元素应该没有“(?P<value>(?:[^"]|\\")*)”内容$/

# i-should-see-element
source: /^(?:|I )should see an? "(?P<element>[^"]*)" element$/
da: /^(?:|skulle jeg )se et element "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte (?:|ich )ein "(?P<element>[^"]*)" Element sehen$/
hu: /^az? "(?P<element>[^"]*)" elemet (?:látnom|látnia) kell$/
pl: /^powinienem widzieć element "(?P<element>[^"]*)"$/
pt: /^(?:|Eu )devo ver um elemento "(?P<element>[^"]*)"$/
pt_br: /^(?:|Eu )devo ver o elemento "(?P<element>[^"]*)"$/
sk: /^(?:mal(?:|a) by|by som mal(?:|a)|musím) (?:|u)vidieť element "(?P<element>[^"]*)"$/
zh_cn: /^(?:|我)应该可以看见“(?P<element>[^"]*)”元素$/
