Repository: Behat/MinkExtension
Catalog: i18n/*.xliff
Languages: da, de, hu, pl, pt, pt_br, sk, zh_cn

# i-should-not-see-element
source: /^(?:|I )should not see an? "(?P<element>[^"]*)" element$/
da: /^(?:|skulle jeg )ikke se et element "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte (?:|ich )kein "(?P<element>[^"]*)" Element sehen$/
hu: /^az? "(?P<element>[^"]*)" elemet nem szabad látnia$/
pl: /^nie powinienem widzieć elementu "(?P<element>[^"]*)"$/
pt: /^(?:|Eu )não devo ver um elemento "(?P<element>[^"]*)"$/
pt_br: /^(?:|Eu )não devo ver o elemento "(?P<element>[^"]*)"$/
sk: /^(?:nemal(?:|a) by som|by som nemal(?:|a)|nesmiem) (?:|u)vidieť element "(?P<element>[^"]*)"$/
zh_cn: /^(?:|我)应该不能看见“(?P<element>[^"]*)”元素$/

# i-should-see-num-elements
source: /^(?:|I )should see (?P<num>\d+) "(?P<element>[^"]*)" elements?$/
da: /^(?:|skulle jeg )se (?P<num>\d+) "(?P<element>[^"]*)" elementer?$/
de: /^(?:|ich )sollte (?:|ich )(?P<num>\d+) "(?P<element>[^"]*)" Elemente? sehen$/
hu: /^(?P<num>\d+) darab "(?P<element>[^"]*)" elemet kell (?:látnom|látnia)$/
pl: /^powinienem widzieć (?P<num>\d+) element(y|ów)? "(?P<element>[^"]*)"$/
pt: /^(?:|Eu )devo ver (?P<num>\d+) elementos? "(?P<element>[^"]*)"$/
pt_br: /^(?:|Eu )devo ver (?P<num>\d+) elementos? "(?P<element>[^"]*)"$/
sk: /^(?:mal(?:|a) by som|by som mal(?:|a)|musím) (?:|u)vidieť (?P<num>\d+) elementov "(?P<element>[^"]*)"$/
zh_cn: /^(?:|我)应该可以看见 (?P<num>\d+) 个“(?P<element>[^"]*)”元素$/

# the-response-status-code-should-be
source: /^the response status code should be (?P<code>\d+)$/
da: /^skulle statuskoderesponsen være (?P<kode>\d+)$/
de: /^(?:|sollte )die Status-Code-Rückmeldung (?:|sollte )(?P<code>\d+) sein$/
hu: /^a válaszüzenet kódjának a következőnek kell lennie: (?P<code>\d+)$/
pl: /^kod (?:|statusu )odpowiedzi powinien (?:wynosić|być równy) (?P<code>\d+)$/
pt: /^o código de status da resposta deve ser (?P<code>\d+)$/
pt_br: /^o código da resposta deve ser (?P<code>\d+)$/
sk: /^(?:|stavový )kód odpovede (?:je|by mal byť|musí byť) (?P<code>\d+)$/
zh_cn: /^返回状态代码应该是 (?P<code>\d+)$/

# the-response-status-code-should-not-be
source: /^the response status code should not be (?P<code>\d+)$/
da: /^skulle statuskoderesponsen ikke være (?P<kode>\d+)$/
de: /^(?:|sollte )die Status-Code-Rückmeldung (?:|sollte )nicht (?P<code>\d+) sein$/
hu: /^a válaszüzenet kódja nem lehet a következő: (?P<code>\d+)$/
pl: /^kod (?:|statusu )odpowiedzi nie powinien (?:wynosić|być równy) (?P<code>\d+)$/
pt: /^o código do statis da resposta não deve ser (?P<code>\d+)$/
pt_br: /^o código da resposta não deve ser (?P<code>\d+)$/
sk: /^(?:|stavový )kód odpovede (?:nie je|by nemal byť|nesmie byť) (?P<code>\d+)$/
zh_cn: /^返回状态代码应该不是 (?P<code>\d+)$/

source: /^print current URL$/
da: /^print den aktuelle URL$/
hu: /^nyomtassa ki az aktuális URL-t$/
pl: /^wypisz obecny URL$/
pt_br: /^imprimir url atual$/

source: /^print last response$/
da: /^udskriv sidste respons$/
de: /^gib die letzte Rückmeldung aus$/
hu: /^nyomtassa ki a legutóbbi választ$/
pl: /^wypisz ostatnią odpowiedź$/
pt: /^imprimir última resposta$/
pt_br: /^imprimir última resposta$/
sk: /^vyťlač poslednú odpoveď$/
zh_cn: /^打印最后一次响应$/

source: /^show last response$/
da: /^vis sidste respons$/
de: /^zeige die letzte Rückmeldung$/
hu: /^mutassa a legutóbi választ$/
pl: /^pokaż ostatnią odpowiedź$/
pt: /^mostrar última resposta$/
pt_br: /^mostrar última resposta$/
sk: /^ukáž poslednú odpoveď$/
zh_cn: /^显示最后一次响应$/

# the-url-should-match
source: /^the (?i)url(?-i) should match (?P<pattern>"(?:[^"]|\\")*")$/
pl: /^(?:url|adres) powinien (?:odpowiadać|pasować do) (?P<pattern>"(?:[^"]|\\")*")$/

# i-am-on-homepage
source: /^(?:|I )am on (?:|the )homepage$/
de: /^(?:|ich )bin (?:|ich )auf (?:|der )Startseite$/

# -should-see-text-matching
source: /^(?:|I )should see text matching (?P<pattern>"(?:[^"]|\\")*")$/
zh_cn: /^(?:|我)应该可以看见文本内容匹配“(?P<pattern>"(?:[^"]|\\")*")”$/

# -should-not-see-text-matching
source: /^(?:|I )should not see text matching (?P<pattern>"(?:[^"]|\\")*")$/
zh_cn: /^(?:|我)应该可以看见文本内容不匹配“(?P<pattern>"(?:[^"]|\\")*")”$/
